package com.example.timetable54

import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import androidx.recyclerview.widget.LinearLayoutManager
import com.example.timetable54.databinding.ActivityMainBinding
import com.example.timetable54.databinding.ActivityMainContentBinding

class MainContent : AppCompatActivity() {
    lateinit var binding: ActivityMainContentBinding
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        binding = ActivityMainContentBinding.inflate(layoutInflater)
        setContentView(binding.root)
        val data = listOf(DayOfWeekModel("Понедельник", listOf(LessonModel("Геометрия","","8:30","9:15","31","","Васильев М.Ю.", "Красовицкий Т.И."),
            LessonModel("Геометрия","","9:25","10:10","31","","Васильев М.Ю.", "Красовицкий Т.И."),
            LessonModel("Алгебра","","10:30","11:15","32","","Смирнова Е.Ю.", "Горяшин Д.В."),
            LessonModel("Алгебра","","11:35","12:20","32","","Смирнова Е.Ю.", "Горяшин Д.В."),
            LessonModel("Биология","","12:30","13:15","2","","Хайдаров Д.Р.", ""),
            LessonModel("История","","13:30","14:15","46","","Стрелков И.П.", ""),
            LessonModel("ОБЖ","","14:35","15:20","3","","Петрушин А.Д.", ""))),DayOfWeekModel("Вторник",
            listOf(LessonModel("Русский язык","","8:30","9:15","33","","Антипова Е.Г.", ""),
            LessonModel("Русский язык","","9:25","10:10","33","","Антипова Е.Г.", ""),
            LessonModel("География","","10:30","11:15","30","","Грушина Т.Н.", ""),
            LessonModel("Химия","","11:15","12:20","42","","Гудалова Т.Н.", ""),
            LessonModel("Специальная математика","","12:30","13:15","31","","Гаргянц А.Г.", "Добровольский Д.Д."),
            LessonModel("Специальная математика","","13:30","14:15","31","","Гаргянц А.Г.", "Добровольский Д.Д."),
            LessonModel("Специальная математика","","14:35","15:20","31","","Гаргянц А.Г.", "Добровольский Д.Д."))), DayOfWeekModel("Среда",
            listOf(LessonModel("Физика","","8:30","9:15","29","","Лабазова С.П.", "Мартыненко Д.Р."),
            LessonModel("Физика","","9:25","10:10","29","","Лабазова С.П.", "Мартыненко Д.Р."),
            LessonModel("Английский язык","Информатика","11:35","12:20","47","43","Мачнева Е.В.", "Тюрина Л.О."),
            LessonModel("Английский язык","Информатика","11:35","12:20","47","43","Мачнева Е.В.", "Тюрина Л.О."),
            LessonModel("Информатика","Английский язык","13:30","14:15","43","19","Тюрина Л.О.", "Лохани Н.Н."),
            LessonModel("Информатика","Английский язык","14:35","15:20","43","19","Тюрина Л.О.", "Лохани Н.Н."))), DayOfWeekModel("Четверг",
            listOf(LessonModel("Родная литература","","8:30","9:15","33","","Антипова Е.Г.", ""),
            LessonModel("Литература","","9:25","10:10","33","","Антипова Е.Г.", ""),
            LessonModel("Английский язык","Английский язык","11:35","12:20","47","43","Мачнева Е.В.", "Лохани Н.Н."),
            LessonModel("Алгебра","","12:30","13:15","32","","Смирнова Е.Ю.", "Горяшин Д.В."),
            LessonModel("Алгебра","","13:30","14:15","32","","Смирнова Е.Ю.", "Горяшин Д.В."),
            LessonModel("Алгебра","","14:35","15:20","32","","Смирнова Е.Ю.", "Горяшин Д.В."))), DayOfWeekModel("Пятница",
            listOf(LessonModel("Геометрия","","8:30","9:15","31","","Васильев М.Ю.", "Красовицкий Т.И."),
            LessonModel("Геометрия","","9:25","10:10","31","","Васильев М.Ю.", "Красовицкий Т.И."),
            LessonModel("География","","10:30","11:15","30","","Грушина Т.Н.", ""),
            LessonModel("Физика","","12:30","13:15","29","","Лабазова С.П.", "Мартыненко Д.Р."),
            LessonModel("Физика","","13:30","14:15","29","","Лабазова С.П.", "Мартыненко Д.Р."),
            LessonModel("Литература","","13:30","14:15","33","","Антипова Е.Г.", ""),
            LessonModel("Литература","","14:35","15:20","33","","Антипова Е.Г.", ""),
            LessonModel("Физическая культура","","15:30","16:15","спортзал","","Моткип П.В.", "")
            )))
        binding.rv.adapter = RecyclerViewDayOfWeekAdapter(data)
        binding.rv.layoutManager = LinearLayoutManager(this)
    }
}